Repository: arfinnaim02/ravintona-sinet
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

source: English
fi: Englanti

source: Finnish
fi: Suomi

source: About
fi: Tietoa meistä

source: About Us
fi: Meistä

source: Welcome to
fi: Tervetuloa

source: A Taste of Joensuu
fi: Joensuun makuja

source: %(name)s is your cozy, inviting restaurant in the heart of Joensuu. Since opening our doors, we’ve been dedicated to crafting delicious, high-quality dishes using the freshest local ingredients. Whether you’re craving a perfectly baked pizza, a juicy burger, or a hearty kebab, we have something to satisfy every taste.
fi: %(name)s on viihtyisä ja kutsuva ravintola Joensuun sydämessä. Avaamisestamme lähtien olemme omistautuneet valmistamaan herkullisia ja laadukkaita annoksia tuoreimmista paikallisista raaka-aineista. Halusitpa täydellisesti paistetun pizzan, mehukkaan hampurilaisen tai täyttävän kebabin, meiltä löydät vaihtoehdon jokaiseen makuun.

source: “Enjoy authentic flavors of Finland and the Mediterranean, made with passion.”
fi: “Nauti Suomen ja Välimeren aidoista mauista – intohimolla valmistettuna.”

source: Signature pizza
fi: Talon pizza

source: Fresh ingredients
fi: Tuoreet raaka-aineet

source: Fresh Ingredients
fi: Tuoreet raaka-aineet

source: We take pride in using locally sourced, top-quality ingredients. Our pizza dough is made in-house daily, ensuring you get the freshest taste in every bite.
fi: Olemme ylpeitä paikallisista ja laadukkaista raaka-aineista. Pizzataikinamme tehdään paikan päällä päivittäin, jotta jokainen suupala maistuu mahdollisimman tuoreelta.

source: Warm ambience
fi: Lämmin tunnelma

source: Warm Ambience
fi: Lämmin tunnelma

source: Our restaurant offers a welcoming and relaxed atmosphere, perfect for dining with family and friends. Enjoy our cozy space filled with the inviting aroma of freshly cooked meals.
fi: Ravintolassamme on lämmin ja rento tunnelma – täydellinen perheelle ja ystäville. Nauti viihtyisästä ympäristöstä ja vastavalmistetun ruoan houkuttelevista tuoksuista.

source: Friendly service
fi: Ystävällinen palvelu

source: Friendly Service
fi: Ystävällinen palvelu

source: Our team is passionate about hospitality. From the moment you arrive, we’re here to make sure you have a memorable dining experience.
fi: Tiimimme rakastaa hyvää palvelua. Hetkestä, kun saavut, olemme täällä varmistaaksemme, että saat ikimuistoisen ruokailukokemuksen.

source: Location
fi: Sijainti

source: Tel:
fi: Puh:

source: Get Directions →
fi: Reittiohjeet →

source: Contact Us
fi: Ota yhteyttä

source: Name
fi: Nimi

source: Email
fi: Sähköposti

source: Message
fi: Viesti

source: We store and process your message to respond to your inquiry. For details, please check our privacy policy.
fi: Tallennamme ja käsittelemme viestisi voidaksemme vastata kyselyysi. Lisätietoja löydät tietosuojaselosteestamme.

source: Send Message →
fi: Lähetä viesti →

source: Checkout
fi: Kassa

source: Confirm details • Pay on delivery • We’ll contact you if needed
fi: Vahvista tiedot • Maksa toimituksen yhteydessä • Otamme yhteyttä tarvittaessa

source: Delivery details
fi: Toimitustiedot

source: Please enter your contact info
fi: Syötä yhteystietosi

source: ← Back to menu
fi: ← Takaisin ruokalistaan

source: Delivery address
fi: Toimitusosoite

source: Distance
fi: Etäisyys

source: Delivery fee
fi: Toimitusmaksu

source: Offer:
fi: Tarjous:

source: FREE DELIVERY
fi: ILMAINEN TOIMITUS

source: min subtotal
fi: minimisumma

source: Your full name
fi: Koko nimesi

source: Please enter your name.
fi: Syötä nimesi.

source: Phone
fi: Puhelin

source: Please enter a valid phone number.
fi: Syötä kelvollinen puhelinnumero.

source: Extra directions for the driver (optional)
fi: Lisäohjeet kuljettajalle (valinnainen)

source: Example: Building A, apartment 12, door code 1234, near K-Market / landmark…
fi: Esimerkki: Talo A, asunto 12, ovikoodi 1234, lähellä K-Markettia / maamerkki…

source: Add a landmark or clear directions so the driver can find you faster.
fi: Lisää maamerkki tai selkeät ohjeet, jotta kuljettaja löytää sinut nopeammin.

source: Note to restaurant (optional)
fi: Viesti ravintolalle (valinnainen)

source: Allergies, no onions, extra spicy…
fi: Allergiat, ei sipulia, extra tulinen…

source: Payment Method
fi: Maksutapa

source: Cash on Delivery
fi: Käteinen toimituksen yhteydessä

source: Pay with cash when your order arrives.
fi: Maksa käteisellä, kun tilauksesi saapuu.

source: Card on Delivery (POS machine)
fi: Kortti toimituksen yhteydessä (maksupääte)

source: Our rider will bring a POS machine for payment.
fi: Kuljettajamme tuo maksupäätteen maksamista varten.

source: Place order →
fi: Tee tilaus →

source: We’ll keep these details for this session.
fi: Säilytämme nämä tiedot tämän istunnon ajan.

source: Your Order
fi: Tilauksesi

source: Clear
fi: Tyhjennä

source: Loyalty reward
fi: Kanta-asiakaspalkinto

source: You unlocked %(p)s%% OFF this month!
fi: Avasit %(p)s%% alennuksen tälle kuukaudelle!

source: Use this coupon on your next order:
fi: Käytä tätä kuponkia seuraavassa tilauksessasi:

source: Use it
fi: Käytä

source: Valid until end of this month. One-time use.
fi: Voimassa kuukauden loppuun. Kertakäyttöinen.

source: Complete %(loyalty.target)s delivered orders this month to get %(p)s%% OFF
fi: Tee %(loyalty.target)s toimitettua tilausta tässä kuussa saadaksesi %(p)s%% alennuksen

source: Progress: %(c)s/%(t)s delivered orders
fi: Edistyminen: %(c)s/%(t)s toimitettua tilausta

source: Order %(r)s more delivered order(s) to unlock the reward.
fi: Tilaa vielä %(r)s toimitettua tilausta avataksesi palkinnon.

source: Coupon
fi: Kuponki

source: Applied:
fi: Käytössä:

source: Remove
fi: Poista

source: Discount is included in totals.
fi: Alennus on huomioitu kokonaissummassa.

source: Enter code
fi: Syötä koodi

source: Apply
fi: Käytä

source: Example:
fi: Esimerkki:

source: Total
fi: Yhteensä

source: Your cart is empty.
fi: Ostoskorisi on tyhjä.

source: Go to menu →
fi: Siirry ruokalistaan →

source: Subtotal
fi: Välisummaa

source: Coupon discount
fi: Kuponkialennus

source: Delivery
fi: Toimitus

source: Free delivery applied
fi: Ilmainen toimitus käytössä

source: Tip: You can still adjust items here before placing the order.
fi: Vinkki: Voit vielä muokata tuotteita täällä ennen tilauksen tekemistä.

source: We’ll contact you if anything is unclear. Thank you!
fi: Otamme yhteyttä, jos jokin on epäselvää. Kiitos!

source: Order confirmed!
fi: Tilaus vahvistettu!

source: We received your order. We’ll contact you shortly to confirm.
fi: Saimme tilauksesi. Otamme pian yhteyttä vahvistaaksemme.

source: Close
fi: Sulje

source: Order #
fi: Tilaus #

source: Payment
fi: Maksu

source: Card on Delivery (POS)
fi: Kortti toimituksen yhteydessä (POS)

source: Status
fi: Tila

source: Delivery information
fi: Toimitustiedot

source: Address:
fi: Osoite:

source: Extra directions:
fi: Lisäohjeet:

source: Phone:
fi: Puhelin:

source: Name:
fi: Nimi:

source: Note:
fi: Huomio:

source: Items
fi: Tuotteet

source: Promotion
fi: Kampanja

source: Free delivery
fi: Ilmainen toimitus

source: Tip: Keep your phone reachable. Our driver may call if your entrance is unclear.
fi: Vinkki: pidä puhelin saatavilla. Kuljettajamme voi soittaa, jos sisäänkäynti on epäselvä.

source: Order again →
fi: Tilaa uudelleen →

source: Done
fi: Valmis

source: Coupon error
fi: Kuponkivirhe

source: Please enter a coupon code.
fi: Syötä kuponkikoodi.

source: Invalid or expired coupon.
fi: Kuponki on virheellinen tai vanhentunut.

source: Could not remove coupon.
fi: Kuponkia ei voitu poistaa.

source: Taste of Joensuu
fi: Joensuun makuja

source: Since 2007
fi: Vuodesta 2007

source: Make Reservation
fi: Tee varaus

source: View Menu
fi: Katso menu

source: Order Online
fi: Tilaa verkossa

source: Locally sourced produce
fi: Paikallisia raaka-aineita

source: Handcrafted Dough
fi: Itsetehty taikina

source: Pizza dough made in-house
fi: Pizzataikina tehdään paikan päällä

source: Open Daily %(hours)s
fi: Avoinna päivittäin %(hours)s

source: Welcome every day.
fi: Tervetuloa joka päivä.

source: Customer Favorites
fi: Asiakkaiden suosikit

source: Most Loved Dishes
fi: Suosituimmat annokset

source: No customer favorites yet. Add tag <b>popular</b> to menu items in the admin panel.
fi: Suosikkeja ei vielä ole. Lisää tagi <b>popular</b> ruokalistatuotteisiin hallintapaneelissa.

source: Explore Our Menu
fi: Tutustu menuumme

source: Find Us
fi: Löydä meidät

source: Visit Ravintola Sinet
fi: Tule käymään Ravintola Sinetissä

source: Address
fi: Osoite

source: Menu – %(restaurant_name)s
fi: Ruokalista – %(restaurant_name)s

source: Ravintola Sinet Promo
fi: Ravintola Sinet Tarjous

source: Pizza, Kebab, Burgers, Gluten Free, Steaks
fi: Pizza, Kebab, Hampurilaiset, Gluteeniton, Pihvit

source: Enjoy Special Coupons with Your Order
fi: Nauti erikoiskupongeista tilauksesi yhteydessä

source: -10%% off
fi: -10%% alennus

source: Ramadan Special – 10%% Off
fi: Ramadan Tarjous – 10%% Alennus

source: on Your First Order
fi: ensimmäisestä tilauksestasi

source: Claim Coupon
fi: Lunasta kuponki

source: Free Delivery
fi: Ilmainen toimitus

source: on Orders Over €30
fi: tilauksiin yli 30 €

source: Save on your order with these great offers!
fi: Säästä tilauksessasi näillä upeilla tarjouksilla!

source: All
fi: Kaikki

source: Menu
fi: Ruokalista

source: All items
fi: Kaikki tuotteet

source: Tap an item to preview • Use
fi: Napauta tuotetta esikatseluun • Käytä

source: to add
fi: lisätäksesi

source: No items found.
fi: Tuotteita ei löytynyt.

source: Now open
fi: Avoinna nyt

source: Order & pickup / delivery
fi: Tilaa & nouda / kotiinkuljetus

source: until
fi: asti

source: FREE DELIVERY APPLIED
fi: ILMAINEN TOIMITUS AKTIVOITU

source: Delivery fee auto-calculated
fi: Toimitusmaksu lasketaan automaattisesti

source: Your cart is empty. Tap
fi: Ostoskorisi on tyhjä. Napauta

source: to add items.
fi: lisätäksesi tuotteita.

source: Discount
fi: Alennus

source: Proceed to Checkout
fi: Siirry kassalle

source: You’ll choose the delivery point on the next step.
fi: Valitset toimituspaikan seuraavassa vaiheessa.

source: Your cart
fi: Ostoskorisi

source: Tap to review & checkout
fi: Napauta tarkistaaksesi & maksaaksesi

source: Cart
fi: Ostoskori

source: Clear cart
fi: Tyhjennä ostoskori

source: Delivery fee is calculated after you set the location.
fi: Toimitusmaksu lasketaan sijainnin valinnan jälkeen.

source: Item details
fi: Tuotetiedot

source: Loading...
fi: Ladataan...

source: Confirm delivery location
fi: Vahvista toimitusosoite

source: Select Date & Time
fi: Valitse päivämäärä ja aika

source: Choose your slot (30-minute intervals).
fi: Valitse aikasi (30 minuutin välein).

source: Select Date
fi: Valitse päivämäärä

source: Sun
fi: Su

source: Mon
fi: Ma

source: Tue
fi: Ti

source: Wed
fi: Ke

source: Thu
fi: To

source: Fri
fi: Pe

source: Sat
fi: La

source: Set Time
fi: Aseta aika

source: Hour
fi: Tunti

source: Minute
fi: Minuutti

source: Open hours: 10:00 to 22:00 (last reservation start 21:30).
fi: Aukioloajat: 10:00–22:00 (viimeinen varauksen aloitus 21:30).

source: Cancel
fi: Peruuta

source: Search your address or drag the pin to your entrance.
fi: Hae osoitteesi tai vedä merkki sisäänkäynnillesi.

source: Use my location →
fi: Käytä sijaintiani →

source: Status:
fi: Tila:

source: Idle
fi: Valmiina

source: Search address
fi: Hae osoite

source: Start typing… e.g., Kauppakatu 10, Joensuu
fi: Aloita kirjoittaminen… esim. Kauppakatu 10, Joensuu

source: Tip: pick a suggestion from the dropdown for best accuracy.
fi: Vinkki: valitse pudotusvalikosta ehdotus parhaan tarkkuuden saamiseksi.

source: Drag pin to entrance
fi: Vedä merkki sisäänkäynnille

source: Accuracy:
fi: Tarkkuus:

source: Selected address
fi: Valittu osoite

source: Delivery radius: <b>%(max_radius)s km</b>.
fi: Toimitussäde: <b>%(max_radius)s km</b>.

source: Confirm & Continue →
fi: Vahvista ja jatka →

source: Select an address or drag the pin, then confirm.
fi: Valitse osoite tai vedä merkkiä, ja vahvista sitten.

source: Delivery Estimate
fi: Toimitusarvio

source: Estimated total
fi: Arvioitu yhteensä

source: Outside delivery range. Please move the pin closer.
fi: Toimitusalueen ulkopuolella. Siirrä merkkiä lähemmäs.

source: You can still scroll this modal; the confirm button stays visible.
fi: Voit yhä vierittää tätä ikkunaa; vahvistuspainike pysyy näkyvissä.

source: Fast
fi: Nopea

source: Smart availability
fi: Älykäs saatavuus

source: Slots are validated automatically on submit.
fi: Ajat tarkistetaan automaattisesti lähetyksen yhteydessä.

source: Comfort
fi: Mukavuus

source: Baby seats supported
fi: Lastenistuimet saatavilla

source: Add baby seats if you need them.
fi: Lisää lastenistuimet tarvittaessa.

source: Bonus
fi: Lisäetu

source: Pre-order food
fi: Ennakkotilaus

source: Select items in the picker; totals update live.
fi: Valitse tuotteet valitsimesta; yhteissumma päivittyy reaaliajassa.

source: Reservation Details
fi: Varaustiedot

source: Choose a date & time (30-minute intervals). Pre-order is optional.
fi: Valitse päivämäärä ja aika (30 minuutin välein). Ennakkotilaus on valinnainen.

source: Please fix the errors:
fi: Korjaa seuraavat virheet:

source: When
fi: Ajankohta

source: 30-minute slots
fi: 30 minuutin ajat

source: Open date & time picker
fi: Avaa päivämäärä- ja aikavalitsin

source: Guests
fi: Vieraat

source: Per slot: 55 chairs, 2 baby seats
fi: Per aika: 55 tuolia, 2 lastenistuinta

source: Party size
fi: Seurueen koko

source: Total chairs available per slot: 55
fi: Tuoleja saatavilla per aika: 55

source: Baby seats
fi: Lastenistuimet

source: Baby seats available per slot: 2
fi: Lastenistuimia saatavilla per aika: 2

source: We’ll use this to confirm your reservation if needed.
fi: Käytämme tätä varauksen vahvistamiseen tarvittaessa.

source: Full name
fi: koko nimi

source: Phone number
fi: Puhelinnumero

source: Email (optional)
fi: Sähköposti (valinnainen)

source: Optional, but helpful for sending updates.
fi: Valinnainen, mutta hyödyllinen päivitysten lähettämiseen.

source: Pre-order Food
fi: Ennakkotilaa ruoka

source: Open picker
fi: Avaa valitsin

source: Adjust quantities before confirming.
fi: Säädä määriä ennen vahvistamista.

source: No items selected.
fi: Ei valittuja tuotteita.

source: By confirming, you agree that staff may contact you if changes are needed.
fi: Vahvistamalla hyväksyt, että henkilökunta voi ottaa yhteyttä, jos muutoksia tarvitaan.

source: Summary
fi: Yhteenveto

source: Pre-order
fi: Ennakkotilaus

source: You can arrive a little early. If you pre-order, we’ll start preparing closer to your slot.
fi: Voit saapua hieman aikaisemmin. Jos teet ennakkotilauksen, aloitamme valmistelun lähempänä varaamaasi aikaa.

source: Need changes? Use the contact page and mention your reservation time + phone.
fi: Tarvitsetko muutoksia? Käytä yhteydenottosivua ja mainitse varausaika + puhelinnumero.

source: Tap item to preview • Use −/+ to change quantity
fi: Napauta tuotetta nähdäksesi esikatselun • Käytä −/+ muuttaaksesi määrää

source: Tip: you can leave pre-order empty and still reserve a table.
fi: Vinkki: voit jättää ennakkotilauksen tyhjäksi ja silti varata pöydän.

source: Review your pre-order at the top.
fi: Tarkista ennakkotilauksesi ylhäältä.

source: No image
fi: Ei kuvaa

source: Qty
fi: Määrä

source: Quantity
fi: Määrä

source: Review
fi: Tarkista

source: This will update your reservation pre-order.
fi: Tämä päivittää varauksen ennakkotilauksen.

source: Reservation placed ✅
fi: Varaus tehty ✅

source: Thanks! Here are your reservation details.
fi: Kiitos! Tässä ovat varauksesi tiedot.

source: Reviews – %(restaurant_name)s
fi: Arvostelut – %(restaurant_name)s

source: Customer Reviews
fi: Asiakasarvostelut

source: Honest Feedback • Real Experiences • Trusted Quality
fi: Rehellinen palaute • Aidot kokemukset • Luotettu laatu

source: Based on %(total_reviews)s verified review
fi: Perustuu %(total_reviews)s varmennettuun arvosteluun

source: Leave a Review
fi: Jätä arvostelu

source: Your Name
fi: Nimesi

source: Your Rating
fi: Arviosi

source: Your Review
fi: Arvostelusi

source: Submit Review
fi: Lähetä arvostelu

source: Previous
fi: Edellinen

source: Page %(page_num)s of %(total_pages)s
fi: Sivu %(page_num)s / %(total_pages)s

source: Next
fi: Seuraava

source: Menu item created successfully.
fi: Ruokalistatuote luotu onnistuneesti.

source: Please set your delivery location first.
fi: Aseta ensin toimitusosoite.

source: My Account
fi: Oma tili

source: Hi %(user_email)s 👋
fi: Hei %(user_email)s 👋

source: My Orders
fi: Omat tilaukset

source: My Reservations
fi: Omat varaukset

source: Loyalty Reward (%(month)s)
fi: Kanta-asiakaspalkinto (%(month)s)

source: Get %(percent)s%% OFF after %(target)s delivered orders this month.
fi: Saat %(percent)s%% alennuksen, kun sinulla on %(target)s toimitettua tilausta tässä kuussa.

source: ✅ You unlocked your reward!
fi: ✅ Palkinto avattu!

source: Your coupon code:
fi: Kuponkikoodisi:

source: Use it during checkout.
fi: Käytä sitä kassalla.

source: Progress: %(c)s/%(t)s
fi: Edistyminen: %(c)s/%(t)s

source: %(remaining)s left
fi: %(remaining)s jäljellä

source: Complete %(remaining)s more delivered order(s) to unlock.
fi: Tee vielä %(remaining)s toimitettua tilausta avataksesi palkinnon.

source: Total Orders
fi: Tilaukset yhteensä

source: Total Reservations
fi: Varaukset yhteensä

source: Upcoming Reservations
fi: Tulevat varaukset

source: Total Spent
fi: Kulutettu yhteensä

source: Recent Orders
fi: Viimeisimmät tilaukset

source: View all
fi: Näytä kaikki

source: No orders yet.
fi: Ei tilauksia vielä.

source: Recent Reservations
fi: Viimeisimmät varaukset

source: No reservations yet.
fi: Ei varauksia vielä.

source: Login
fi: Kirjaudu

source: Welcome back 👋
fi: Tervetuloa takaisin 👋

source: Password
fi: Salasana

source: Forgot password?
fi: Unohditko salasanan?

source: Create account
fi: Luo tili

source: Reset password
fi: Vaihda salasana

source: Enter your email and we’ll send you a reset link.
fi: Syötä sähköpostisi, niin lähetämme salasananvaihtolinkin.

source: Send reset link
fi: Lähetä vaihtolinkki

source: Password updated
fi: Salasana päivitetty

source: You can now login with your new password.
fi: Voit nyt kirjautua uudella salasanallasi.

source: Set new password
fi: Aseta uusi salasana

source: Enter your new password below.
fi: Syötä uusi salasanasi alle.

source: Update password
fi: Päivitä salasana

source: Reset link invalid
fi: Vaihtolinkki ei kelpaa

source: This reset link is invalid or has already been used.
fi: Tämä vaihtolinkki on virheellinen tai se on jo käytetty.

source: Request a new link
fi: Pyydä uusi linkki

source: Check your email
fi: Tarkista sähköposti

source: If an account exists with that email, a reset link has been sent.
fi: Jos tili löytyy tällä sähköpostilla, vaihtolinkki on lähetetty.

source: Back to login
fi: Takaisin kirjautumiseen

source: Create Account
fi: Luo tili

source: Track your orders and reservations in one place.
fi: Seuraa tilauksia ja varauksia yhdessä paikassa.

source: Phone (optional)
fi: Puhelin (valinnainen)

source: Confirm Password
fi: Vahvista salasana

source: Sign up
fi: Rekisteröidy

source: Already have an account?
fi: Onko sinulla jo tili?

source: Home
fi: Etusivu

source: Signed in as
fi: Kirjautuneena käyttäjänä

source: Welcome
fi: Tervetuloa

source: Login to manage orders & reservations.
fi: Kirjaudu hallitaksesi tilauksia ja varauksia.

source: Logout
fi: Kirjaudu ulos

source: Account
fi: Tili

source: Login or create account
fi: Kirjaudu tai luo tili

source: Dashboard
fi: Hallintapaneeli

source: Opening Times
fi: Aukioloajat

source: Contact
fi: Yhteystiedot

source: Order on Wolt
fi: Tilaa Woltista

source: All rights reserved.
fi: Kaikki oikeudet pidätetään.
